; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-3-4)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	s13 - location
	p0-2 - location
	p1-4 - location
	p1-12 - location
	p2-5 - location
	p2-8 - location
	p2-12 - location
	p3-2 - location
	p3-6 - location
	p3-12 - location
	p4-0 - location
	p4-7 - location
	p4-8 - location
	p4-12 - location
	p4-13 - location
	p5-10 - location
	p6-2 - location
	p7-3 - location
	p7-11 - location
	p8-3 - location
	p9-0 - location
	p10-0 - location
	p10-9 - location
	p10-12 - location
	p11-6 - location
	p12-6 - location
	p13-1 - location
	p13-8 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s1)
	(at driver3 s1)
	(at truck1 s7)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s9)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s10)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s13)
	(at package2 s10)
	(at package3 s7)
	(at package4 s6)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s1 p1-12)
	(path p1-12 s1)
	(path s12 p1-12)
	(path p1-12 s12)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s2 p2-8)
	(path p2-8 s2)
	(path s8 p2-8)
	(path p2-8 s8)
	(path s2 p2-12)
	(path p2-12 s2)
	(path s12 p2-12)
	(path p2-12 s12)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(path s3 p3-12)
	(path p3-12 s3)
	(path s12 p3-12)
	(path p3-12 s12)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(path s4 p4-8)
	(path p4-8 s4)
	(path s8 p4-8)
	(path p4-8 s8)
	(path s4 p4-12)
	(path p4-12 s4)
	(path s12 p4-12)
	(path p4-12 s12)
	(path s4 p4-13)
	(path p4-13 s4)
	(path s13 p4-13)
	(path p4-13 s13)
	(path s5 p5-10)
	(path p5-10 s5)
	(path s10 p5-10)
	(path p5-10 s10)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(path s7 p7-11)
	(path p7-11 s7)
	(path s11 p7-11)
	(path p7-11 s11)
	(path s8 p8-3)
	(path p8-3 s8)
	(path s3 p8-3)
	(path p8-3 s3)
	(path s9 p9-0)
	(path p9-0 s9)
	(path s0 p9-0)
	(path p9-0 s0)
	(path s10 p10-0)
	(path p10-0 s10)
	(path s0 p10-0)
	(path p10-0 s0)
	(path s10 p10-9)
	(path p10-9 s10)
	(path s9 p10-9)
	(path p10-9 s9)
	(path s10 p10-12)
	(path p10-12 s10)
	(path s12 p10-12)
	(path p10-12 s12)
	(path s11 p11-6)
	(path p11-6 s11)
	(path s6 p11-6)
	(path p11-6 s6)
	(path s12 p12-6)
	(path p12-6 s12)
	(path s6 p12-6)
	(path p12-6 s6)
	(path s13 p13-1)
	(path p13-1 s13)
	(path s1 p13-1)
	(path p13-1 s1)
	(path s13 p13-8)
	(path p13-8 s13)
	(path s8 p13-8)
	(path p13-8 s8)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 17)
	(= (time-to-drive s4 s0) 17)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 86)
	(= (time-to-drive s7 s0) 86)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 30)
	(= (time-to-drive s6 s1) 30)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 84)
	(= (time-to-drive s1 s2) 84)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 96)
	(= (time-to-drive s3 s2) 96)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 34)
	(= (time-to-drive s4 s2) 34)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 61)
	(= (time-to-drive s6 s2) 61)
	(link s2 s7)
	(link s7 s2)
	(= (time-to-drive s2 s7) 93)
	(= (time-to-drive s7 s2) 93)
	(link s2 s11)
	(link s11 s2)
	(= (time-to-drive s2 s11) 39)
	(= (time-to-drive s11 s2) 39)
	(link s2 s13)
	(link s13 s2)
	(= (time-to-drive s2 s13) 53)
	(= (time-to-drive s13 s2) 53)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 95)
	(= (time-to-drive s1 s3) 95)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 24)
	(= (time-to-drive s4 s3) 24)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 71)
	(= (time-to-drive s6 s3) 71)
	(link s3 s8)
	(link s8 s3)
	(= (time-to-drive s3 s8) 54)
	(= (time-to-drive s8 s3) 54)
	(link s4 s10)
	(link s10 s4)
	(= (time-to-drive s4 s10) 42)
	(= (time-to-drive s10 s4) 42)
	(link s4 s11)
	(link s11 s4)
	(= (time-to-drive s4 s11) 27)
	(= (time-to-drive s11 s4) 27)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 47)
	(= (time-to-drive s1 s5) 47)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 61)
	(= (time-to-drive s2 s5) 61)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 74)
	(= (time-to-drive s4 s5) 74)
	(link s5 s12)
	(link s12 s5)
	(= (time-to-drive s5 s12) 40)
	(= (time-to-drive s12 s5) 40)
	(link s5 s13)
	(link s13 s5)
	(= (time-to-drive s5 s13) 91)
	(= (time-to-drive s13 s5) 91)
	(link s7 s9)
	(link s9 s7)
	(= (time-to-drive s7 s9) 79)
	(= (time-to-drive s9 s7) 79)
	(link s7 s13)
	(link s13 s7)
	(= (time-to-drive s7 s13) 50)
	(= (time-to-drive s13 s7) 50)
	(link s8 s0)
	(link s0 s8)
	(= (time-to-drive s8 s0) 12)
	(= (time-to-drive s0 s8) 12)
	(link s9 s2)
	(link s2 s9)
	(= (time-to-drive s9 s2) 17)
	(= (time-to-drive s2 s9) 17)
	(link s9 s3)
	(link s3 s9)
	(= (time-to-drive s9 s3) 7)
	(= (time-to-drive s3 s9) 7)
	(link s10 s2)
	(link s2 s10)
	(= (time-to-drive s10 s2) 65)
	(= (time-to-drive s2 s10) 65)
	(link s10 s5)
	(link s5 s10)
	(= (time-to-drive s10 s5) 85)
	(= (time-to-drive s5 s10) 85)
	(link s10 s7)
	(link s7 s10)
	(= (time-to-drive s10 s7) 60)
	(= (time-to-drive s7 s10) 60)
	(link s10 s13)
	(link s13 s10)
	(= (time-to-drive s10 s13) 29)
	(= (time-to-drive s13 s10) 29)
	(link s12 s4)
	(link s4 s12)
	(= (time-to-drive s12 s4) 59)
	(= (time-to-drive s4 s12) 59)
	(link s12 s8)
	(link s8 s12)
	(= (time-to-drive s12 s8) 76)
	(= (time-to-drive s8 s12) 76)
	(link s12 s10)
	(link s10 s12)
	(= (time-to-drive s12 s10) 14)
	(= (time-to-drive s10 s12) 14)
	(link s12 s13)
	(link s13 s12)
	(= (time-to-drive s12 s13) 88)
	(= (time-to-drive s13 s12) 88)
	(link s13 s0)
	(link s0 s13)
	(= (time-to-drive s13 s0) 60)
	(= (time-to-drive s0 s13) 60)
	(link s13 s3)
	(link s3 s13)
	(= (time-to-drive s13 s3) 10)
	(= (time-to-drive s3 s13) 10)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s2)
	(at driver2 s7)
	(at driver3 s10)
	(at truck2 s2)
	(at truck3 s4)
	(at package1 s6)
	(at package2 s9)
	(at package3 s0)
	(at package4 s1)
	))

(:metric minimize (+ (* 1 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (walk driver2 s1 p1-4)
   deleted: (at driver2 s1)
   added: (at driver2 p1-4)
   goals met: 0 of 9
2. (walk driver1 s0 p9-0)
   deleted: (at driver1 s0)
   added: (at driver1 p9-0)
   goals met: 0 of 9
3. (walk driver1 p9-0 s9)
   deleted: (at driver1 p9-0)
   added: (at driver1 s9)
   goals met: 0 of 9
4. (walk driver2 p1-4 s4)
   deleted: (at driver2 p1-4)
   added: (at driver2 s4)
   goals met: 0 of 9
5. (walk driver3 s1 p1-12)
   deleted: (at driver3 s1)
   added: (at driver3 p1-12)
   goals met: 0 of 9
6. (board-truck driver1 truck2 s9)
   deleted: (at driver1 s9) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 0 of 9
7. (walk driver2 s4 p4-7)
   deleted: (at driver2 s4)
   added: (at driver2 p4-7)
   goals met: 0 of 9
8. (walk driver3 p1-12 s12)
   deleted: (at driver3 p1-12)
   added: (at driver3 s12)
   goals met: 0 of 9
9. (drive-truck truck2 s9 s2 driver1)
   deleted: (at truck2 s9)
   added: (at truck2 s2)
   changed: (fuel-used) from 0 to 170
   goals met: 1 of 9
10. (walk driver3 s12 p10-12)
   deleted: (at driver3 s12)
   added: (at driver3 p10-12)
   goals met: 1 of 9
11. (walk driver2 p4-7 s7)
   deleted: (at driver2 p4-7)
   added: (at driver2 s7)
   goals met: 2 of 9
12. (walk driver3 p10-12 s10)
   deleted: (at driver3 p10-12)
   added: (at driver3 s10)
   goals met: 3 of 9
13. (load-truck package3 truck1 s7)
   deleted: (at package3 s7)
   added: (in package3 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 3 of 9
14. (board-truck driver2 truck1 s7)
   deleted: (at driver2 s7) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 2 of 9
15. (drive-truck truck1 s7 s0 driver2)
   deleted: (at truck1 s7)
   added: (at truck1 s0)
   changed: (fuel-used) from 170 to 1116
   goals met: 2 of 9
16. (unload-truck package3 truck1 s0)
   deleted: (in package3 truck1)
   added: (at package3 s0)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 3 of 9
17. (drive-truck truck1 s0 s7 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s7)
   changed: (fuel-used) from 1116 to 1976
   goals met: 3 of 9
18. (disembark-truck driver2 truck1 s7)
   deleted: (driving driver2 truck1)
   added: (at driver2 s7) (empty truck1)
   goals met: 4 of 9
19. (drive-truck truck2 s2 s6 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s6)
   changed: (fuel-used) from 1976 to 2586
   goals met: 3 of 9
20. (board-truck driver3 truck3 s10)
   deleted: (at driver3 s10) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 2 of 9
21. (load-truck package2 truck3 s10)
   deleted: (at package2 s10)
   added: (in package2 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 2 of 9
22. (load-truck package4 truck2 s6)
   deleted: (at package4 s6)
   added: (in package4 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 2 of 9
23. (drive-truck truck2 s6 s1 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s1)
   changed: (fuel-used) from 2586 to 2916
   goals met: 2 of 9
24. (unload-truck package4 truck2 s1)
   deleted: (in package4 truck2)
   added: (at package4 s1)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 3 of 9
25. (drive-truck truck3 s10 s2 driver3)
   deleted: (at truck3 s10)
   added: (at truck3 s2)
   changed: (fuel-used) from 2916 to 3631
   goals met: 3 of 9
26. (drive-truck truck2 s1 s2 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (fuel-used) from 3631 to 4471
   goals met: 4 of 9
27. (disembark-truck driver1 truck2 s2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s2) (empty truck2)
   goals met: 5 of 9
28. (drive-truck truck3 s2 s9 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s9)
   changed: (fuel-used) from 4471 to 4658
   goals met: 5 of 9
29. (unload-truck package2 truck3 s9)
   deleted: (in package2 truck3)
   added: (at package2 s9)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 6 of 9
30. (drive-truck truck3 s9 s3 driver3)
   deleted: (at truck3 s9)
   added: (at truck3 s3)
   changed: (fuel-used) from 4658 to 4728
   goals met: 6 of 9
31. (drive-truck truck3 s3 s4 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   changed: (fuel-used) from 4728 to 4968
   goals met: 7 of 9
32. (board-truck driver2 truck1 s7)
   deleted: (at driver2 s7) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 6 of 9
33. (drive-truck truck1 s7 s13 driver2)
   deleted: (at truck1 s7)
   added: (at truck1 s13)
   changed: (fuel-used) from 4968 to 5468
   goals met: 6 of 9
34. (load-truck package1 truck1 s13)
   deleted: (at package1 s13)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 6 of 9
35. (drive-truck truck1 s13 s7 driver2)
   deleted: (at truck1 s13)
   added: (at truck1 s7)
   changed: (fuel-used) from 5468 to 6018
   goals met: 6 of 9
36. (disembark-truck driver2 truck1 s7)
   deleted: (driving driver2 truck1)
   added: (at driver2 s7) (empty truck1)
   goals met: 7 of 9
37. (drive-truck truck3 s4 s10 driver3)
   deleted: (at truck3 s4)
   added: (at truck3 s10)
   changed: (fuel-used) from 6018 to 6438
   goals met: 6 of 9
38. (drive-truck truck3 s10 s2 driver3)
   deleted: (at truck3 s10)
   added: (at truck3 s2)
   changed: (fuel-used) from 6438 to 7088
   goals met: 6 of 9
39. (drive-truck truck3 s2 s6 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s6)
   changed: (fuel-used) from 7088 to 7698
   goals met: 6 of 9
40. (board-truck driver2 truck1 s7)
   deleted: (at driver2 s7) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 5 of 9
41. (drive-truck truck3 s6 s3 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s3)
   changed: (fuel-used) from 7698 to 8408
   goals met: 5 of 9
42. (drive-truck truck3 s3 s13 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s13)
   changed: (fuel-used) from 8408 to 8508
   goals met: 5 of 9
43. (drive-truck truck1 s7 s2 driver2)
   deleted: (at truck1 s7)
   added: (at truck1 s2)
   changed: (fuel-used) from 8508 to 9531
   goals met: 5 of 9
44. (drive-truck truck3 s13 s0 driver3)
   deleted: (at truck3 s13)
   added: (at truck3 s0)
   changed: (fuel-used) from 9531 to 10131
   goals met: 5 of 9
45. (disembark-truck driver3 truck3 s0)
   deleted: (driving driver3 truck3)
   added: (at driver3 s0) (empty truck3)
   goals met: 5 of 9
46. (drive-truck truck1 s2 s7 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s7)
   changed: (fuel-used) from 10131 to 11154
   goals met: 5 of 9
47. (walk driver3 s0 p10-0)
   deleted: (at driver3 s0)
   added: (at driver3 p10-0)
   goals met: 5 of 9
48. (walk driver3 p10-0 s10)
   deleted: (at driver3 p10-0)
   added: (at driver3 s10)
   goals met: 6 of 9
49. (walk driver1 s2 p0-2)
   deleted: (at driver1 s2)
   added: (at driver1 p0-2)
   goals met: 5 of 9
50. (drive-truck truck1 s7 s2 driver2)
   deleted: (at truck1 s7)
   added: (at truck1 s2)
   changed: (fuel-used) from 11154 to 12177
   goals met: 5 of 9
51. (drive-truck truck1 s2 s6 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   changed: (fuel-used) from 12177 to 12848
   goals met: 5 of 9
52. (unload-truck package1 truck1 s6)
   deleted: (in package1 truck1)
   added: (at package1 s6)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 6 of 9
53. (walk driver1 p0-2 s0)
   deleted: (at driver1 p0-2)
   added: (at driver1 s0)
   goals met: 6 of 9
54. (board-truck driver1 truck3 s0)
   deleted: (at driver1 s0) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 6 of 9
55. (drive-truck truck3 s0 s4 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s4)
   changed: (fuel-used) from 12848 to 13018
   goals met: 7 of 9
56. (drive-truck truck3 s4 s2 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s2)
   changed: (fuel-used) from 13018 to 13358
   goals met: 6 of 9
57. (disembark-truck driver2 truck1 s6)
   deleted: (driving driver2 truck1)
   added: (at driver2 s6) (empty truck1)
   goals met: 6 of 9
58. (drive-truck truck3 s2 s6 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s6)
   changed: (fuel-used) from 13358 to 13968
   goals met: 6 of 9
59. (drive-truck truck3 s6 s3 driver1)
   deleted: (at truck3 s6)
   added: (at truck3 s3)
   changed: (fuel-used) from 13968 to 14678
   goals met: 6 of 9
60. (disembark-truck driver1 truck3 s3)
   deleted: (driving driver1 truck3)
   added: (at driver1 s3) (empty truck3)
   goals met: 6 of 9
61. (board-truck driver2 truck1 s6)
   deleted: (at driver2 s6) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 6 of 9
62. (drive-truck truck1 s6 s2 driver2)
   deleted: (at truck1 s6)
   added: (at truck1 s2)
   changed: (fuel-used) from 14678 to 15288
   goals met: 6 of 9
63. (drive-truck truck1 s2 s7 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s7)
   changed: (fuel-used) from 15288 to 16218
   goals met: 6 of 9
64. (disembark-truck driver2 truck1 s7)
   deleted: (driving driver2 truck1)
   added: (at driver2 s7) (empty truck1)
   goals met: 7 of 9
65. (walk driver1 s3 p3-2)
   deleted: (at driver1 s3)
   added: (at driver1 p3-2)
   goals met: 7 of 9
66. (walk driver1 p3-2 s2)
   deleted: (at driver1 p3-2)
   added: (at driver1 s2)
   goals met: 8 of 9
67. (walk driver2 s7 p7-3)
   deleted: (at driver2 s7)
   added: (at driver2 p7-3)
   goals met: 7 of 9
68. (walk driver2 p7-3 s3)
   deleted: (at driver2 p7-3)
   added: (at driver2 s3)
   goals met: 7 of 9
69. (board-truck driver2 truck3 s3)
   deleted: (at driver2 s3) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 7 of 9
70. (drive-truck truck3 s3 s4 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   changed: (fuel-used) from 16218 to 16458
   goals met: 8 of 9
71. (disembark-truck driver2 truck3 s4)
   deleted: (driving driver2 truck3)
   added: (at driver2 s4) (empty truck3)
   goals met: 8 of 9
72. (walk driver2 s4 p4-7)
   deleted: (at driver2 s4)
   added: (at driver2 p4-7)
   goals met: 8 of 9
73. (walk driver2 p4-7 s7)
   deleted: (at driver2 p4-7)
   added: (at driver2 s7)
   goals met: 9 of 9
